import React, {useEffect} from 'react';
import styles from './About.module.scss';
import {useLocation} from "react-router-dom";
import multfilmStyles from "../Multfilm/Multfilm.module.scss";

const About = () => {
    const location = useLocation();

    useEffect(() => {
        if (location.pathname === '/about') {
            document.title = 'Проект турында';
        } else {
            document.title = 'Проектның методикасы'
        }
    }, [location.pathname]);

    return (
        <div style={{minHeight: '100vh'}}>
            <div className={styles.aboutBlock}>
                <div className={styles.aboutBlock_content}>
                    <h1>{location.pathname === '/about' ? 'Проект турында' : 'Проектның методикасы'}</h1>
                    <div className={styles.text}>
                        {
                            location.pathname === '/about' ? (
                                <>
                                    <p>
                                        «Әминә» – Казан мэриясе проекты. Ул Татарстан Республикасы Рәисе каршындагы Татар телен һәм Татарстан Республикасында яшәүче халыклар вәкилләренең туган телләрен саклау, үстерү мәсьәләләре комиссиясе ярдәме белән «Татармультфильм» студиясе тарафыннан гамәлгә ашырылды. Проект балаларга белем бирү, татар телен популярлаштыру юнәлешендәге мәдәни контентны үстерүгә йөз тота.
                                    </p>
                                    <p>
                                        «Әминә» проекты – методикага туры килә торган кызыклы видеографик анимацион сериал. Ул татар балаларында әйләнә-тирә дөньяны танып белү аша туган телгә кызыксыну уяту, аны өйрәтү, башлангыч дәрәҗәдә аңлату максатларын куя.
                                    </p>
                                    <p>
                                        Проект Татарстан Республикасы Мәгариф һәм фән министрлыгы тарафыннан расланган программадагы лексик минимумга нигезләнә.
                                    </p>
                                    <p>
                                        32 җырлы анимацион фильмның һәркайсы билгеле бер темага багышланган. Алар матур җыр сүзләре, сабыйларга якын, аңлаешлы рәсемнәр, мавыктыргыч анимация ярдәмендә лексик минимумга кергән сүзләрне истә калдырырга ярдәм итә.
                                    </p>
                                    <span>
                                        «Әминә» проектының уңай яклары:
                                    </span>
                                    <p>
                                        – лексик минимумны өйрәтүдә практик әһәмияте;
                                    </p>
                                    <p>
                                        – заманча методикаларга, сыналган алымнарга нигезләнеп эшләнүе;
                                    </p>
                                    <p>
                                        – җырларның тиз истә калуы;
                                    </p>
                                    <p>
                                        – һәр җырның мультфильмы булуы;
                                    </p>
                                    <p>
                                        – анимацион сериалны тәрбия процессында киң куллану мөмкинлеге (сөйләмне үстерү, әдәп-әхлак тәрбиясе, танып-белү үсеше һ.б.).
                                    </p>
                                    <span>
                                        АВТОРЛАР:
                                    </span>
                                    <p>
                                        Проектның идея авторы – <span>Гүзәл Сәгыйтова</span>
                                    </p>
                                    <p>
                                        Проектның кураторы – <span>Алсу Низамиева</span>
                                    </p>
                                    <p>
                                        Җыр сүзләре авторы – <span>Резеда Зәйни (Гобәева)</span>
                                    </p>
                                    <p>
                                        Көйләр авторы – <span>Миләүшә Хәйруллина</span>
                                    </p>
                                    <p>
                                        Аранжировкалар ясаучы – <span>Кирилл Фурсов</span>
                                    </p>
                                    <p>
                                        Баш режиссёр –<span> Сергей Киатров</span>
                                    </p>
                                    <p>
                                        Икенче режиссёр –<span> Татьяна Филиппова</span>
                                    </p>
                                    <p>
                                        Рәссам-аниматорлар –<span> Алексей Лучников</span>
                                    </p>
                                    <span style={{marginLeft: "29%"}}>Радик Шәрифуллин</span>
                                    <span style={{marginLeft: "29%"}}>Аида Ромашова</span>
                                    <span style={{marginLeft: "29%"}}>Ольга Волкова</span>
                                    <span style={{marginLeft: "29%"}}>Регина Сәфәрова</span>
                                    <span style={{marginLeft: "29%"}}>Гүзәл Әскәрова</span>
                                    <span style={{marginLeft: "29%"}}>Ландыш Гарипова</span>
                                    <span style={{marginLeft: "29%"}}>Анастасия Задорина</span>
                                    <span style={{marginLeft: "29%"}}>Полина Башорина</span>
                                    <p>
                                        Видеомонтажёр – <span>Радион Вәлиев</span>
                                    </p>
                                </>
                            ) : (
                                <>
                                    <p>
                                        Проект мәктәпкәчә белем бирүнең методик һәм практик белгечләре белән килештереп тормышка ашырыла. Проект балалар бакчаларындагы сабыйларның татар телен башлангыч дәрәҗәдә белүенә һәм аңлавына ирешү максатын куеп эшләнә. Мәктәпкәчә белем бирү учреждениеләрендә һәр атна (32 атналык уку елы дәвамында) сериалны балалар белән карау һәм өйрәнү нәтиҗәле. Проект  татар телле төркемнәрдә дә, белем-тәрбия бирү рус телендә алып барыла торган төркемнәрдә дә, шулай ук башлангыч мәктәпләрдә дә кулланырга була.
                                    </p>
                                    <p>
                                        Анимацион сериалның аерым серияләрен балалар бакчаларында сөйләмне үстерү, танып белү шөгыльләре вакытында карау уңышлы.  “Әминә” җырын физкультминутлар өчен да куллану бик җайлы. Ел фасыллары белән бәйле бәйрәмнәр һәм башка чаралар вакытында (“Көзге уңыш” бәйрәме, “Гаилә” бәйрәме, “Кышны озату” бәйрәме һ.б.)  вакытында “Әминә”нең җырларын күмәкләп җырларга мөмкин. Алардан кыска инсценировкалар, уеннар ясарга да була. Бу исә балаларның сүзләрне тагын да яхшырак истә калдыруын тәэмин итәчәк.
                                    </p>
                                    <p>
                                        Проект мәктәпкәчә белем бирү учреждениеләре тәрбиячеләре һәм методистларының татар телен өйрәтү, аны уку-укытуга бәйле эшчәнлеген җиңеләйтәчәк.
                                    </p>
                                </>
                            )
                        }
                    </div>
                </div>
                <img className={styles.aminaPic} src="/img/aminaAboutPic.png" alt=""/>
            </div>
            <div className={`${multfilmStyles.footer} ${styles.footer_about}`}>
                <p>
                    Проект Казан мэриясе ярдәме белән «Татармультфильм» студиясе тарафыннан гамәлгә ашырылды.  Проект балалар өчен белем бирү, татар телен популярлаштыру юнәлешендәге мәдәни контентны  үстерүгә йөз тота.
                </p>
                <p>
                    © 2024 «Әминә». Барлык хокуклар якланган. Сайт материалларын язма рөхсәт белән генә файдаланырга ярый.
                </p>
            </div>
        </div>
    );
};

export default About;